leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.SCB.h
/*
 * S32K1xx.SCB.h
 *
 *  Created on: 2020年1月14日
 *      Author: Master.HE
 */

#ifndef S32K1XX_SCB_H_
#define S32K1XX_SCB_H_

#include "S32K1xx.Type.h"

/* ----------------------------------------------------------------------------
   -- S32_SCB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SCB_Peripheral_Access_Layer S32_SCB Peripheral Access Layer
 * @{
 */


/** S32_SCB - Size of Registers Arrays */

/** S32_SCB - Register Layout Typedef */
typedef struct {
	uint8_t RESERVED_0[8];

#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
	__I  uint32_t ACTLR;                             /**< Auxiliary Control Register,, offset: 0x8 */
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
	__IO uint32_t ACTLR;                             /**< Auxiliary Control Register,, offset: 0x8 */
#endif

	uint8_t RESERVED_1[3316];
	__I  uint32_t CPUID;                             /**< CPUID Base Register, offset: 0xD00 */
	__IO uint32_t ICSR;                              /**< Interrupt Control and State Register, offset: 0xD04 */
	__IO uint32_t VTOR;                              /**< Vector Table Offset Register, offset: 0xD08 */
	__IO uint32_t AIRCR;                             /**< Application Interrupt and Reset Control Register, offset: 0xD0C */
	__IO uint32_t SCR;                               /**< System Control Register, offset: 0xD10 */

#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
	__I  uint32_t CCR;                               /**< Configuration and Control Register, offset: 0xD14 */
	uint8_t RESERVED_2[4];
	union
	{
		__IO uint32_t SHP[2U];                /*!< Offset: 0x01C (R/W)  System Handlers Priority Registers. [0] is RESERVED */
		struct
		{
			__IO uint32_t SHPR2;                             /**< System Handler Priority Register 2, offset: 0xD1C */
			__IO uint32_t SHPR3;                             /**< System Handler Priority Register 3, offset: 0xD20 */
		};
	};

#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
	__IO uint32_t CCR;                               /**< Configuration and Control Register, offset: 0xD14 */
	union
	{
		__IO uint8_t  SHP[12U];               /*!< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) */
		struct
		{
			__IO uint32_t SHPR1;                             /**< System Handler Priority Register 1, offset: 0xD18 */
			__IO uint32_t SHPR2;                             /**< System Handler Priority Register 2, offset: 0xD1C */
			__IO uint32_t SHPR3;                             /**< System Handler Priority Register 3, offset: 0xD20 */
		};
	};

#endif

	__IO uint32_t SHCSR;                             /**< System Handler Control and State Register, offset: 0xD24 */

#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
	uint8_t RESERVED_3[8];
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
	__IO uint32_t CFSR;                              /**< Configurable Fault Status Registers, offset: 0xD28 */
	__IO uint32_t HFSR;                              /**< HardFault Status register, offset: 0xD2C */
#endif

	__IO uint32_t DFSR;                              /**< Debug Fault Status Register, offset: 0xD30 */

#if (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
	__IO uint32_t MMFAR;                             /**< MemManage Address Register, offset: 0xD34 */
	__IO uint32_t BFAR;                              /**< BusFault Address Register, offset: 0xD38 */
	__IO uint32_t AFSR;                              /**< Auxiliary Fault Status Register, offset: 0xD3C */
	uint8_t RESERVED_2[72];
	__IO uint32_t CPACR;                             /**< Coprocessor Access Control Register, offset: 0xD88 */
	uint8_t RESERVED_3[424];
	__IO uint32_t FPCCR;                             /**< Floating-point Context Control Register, offset: 0xF34 */
	__IO uint32_t FPCAR;                             /**< Floating-point Context Address Register, offset: 0xF38 */
	__IO uint32_t FPDSCR;                            /**< Floating-point Default Status Control Register, offset: 0xF3C */
#endif
} S32_SCB_Type, *S32_SCB_MemMapPtr;

 /** Number of instances of the S32_SCB module. */
#define S32_SCB_INSTANCE_COUNT                   (1u)


/* S32_SCB - Peripheral instance base addresses */
/** Peripheral S32_SCB base address */
#define S32_SCB_BASE                             (0xE000E000u)
/** Peripheral S32_SCB base pointer */
#define S32_SCB                                  ((S32_SCB_Type *)S32_SCB_BASE)
/** Array initializer of S32_SCB peripheral base addresses */
#define S32_SCB_BASE_ADDRS                       { S32_SCB_BASE }
/** Array initializer of S32_SCB peripheral base pointers */
#define S32_SCB_BASE_PTRS                        { S32_SCB }

/* ----------------------------------------------------------------------------
   -- S32_SCB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SCB_Register_Masks S32_SCB Register Masks
 * @{
 */
#if (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
/* ACTLR Bit Fields */
#define S32_SCB_ACTLR_DISMCYCINT_MASK            0x1u
#define S32_SCB_ACTLR_DISMCYCINT_SHIFT           0u
#define S32_SCB_ACTLR_DISMCYCINT_WIDTH           1u
#define S32_SCB_ACTLR_DISMCYCINT(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ACTLR_DISMCYCINT_SHIFT))&S32_SCB_ACTLR_DISMCYCINT_MASK)
#define S32_SCB_ACTLR_DISDEFWBUF_MASK            0x2u
#define S32_SCB_ACTLR_DISDEFWBUF_SHIFT           1u
#define S32_SCB_ACTLR_DISDEFWBUF_WIDTH           1u
#define S32_SCB_ACTLR_DISDEFWBUF(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ACTLR_DISDEFWBUF_SHIFT))&S32_SCB_ACTLR_DISDEFWBUF_MASK)
#define S32_SCB_ACTLR_DISFOLD_MASK               0x4u
#define S32_SCB_ACTLR_DISFOLD_SHIFT              2u
#define S32_SCB_ACTLR_DISFOLD_WIDTH              1u
#define S32_SCB_ACTLR_DISFOLD(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_ACTLR_DISFOLD_SHIFT))&S32_SCB_ACTLR_DISFOLD_MASK)
#define S32_SCB_ACTLR_DISFPCA_MASK               0x100u
#define S32_SCB_ACTLR_DISFPCA_SHIFT              8u
#define S32_SCB_ACTLR_DISFPCA_WIDTH              1u
#define S32_SCB_ACTLR_DISFPCA(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_ACTLR_DISFPCA_SHIFT))&S32_SCB_ACTLR_DISFPCA_MASK)
#define S32_SCB_ACTLR_DISOOFP_MASK               0x200u
#define S32_SCB_ACTLR_DISOOFP_SHIFT              9u
#define S32_SCB_ACTLR_DISOOFP_WIDTH              1u
#define S32_SCB_ACTLR_DISOOFP(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_ACTLR_DISOOFP_SHIFT))&S32_SCB_ACTLR_DISOOFP_MASK)
#endif

/* CPUID Bit Fields */
#define S32_SCB_CPUID_REVISION_MASK              0xFu
#define S32_SCB_CPUID_REVISION_SHIFT             0u
#define S32_SCB_CPUID_REVISION_WIDTH             4u
#define S32_SCB_CPUID_REVISION(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_REVISION_SHIFT))&S32_SCB_CPUID_REVISION_MASK)
#define S32_SCB_CPUID_PARTNO_MASK                0xFFF0u
#define S32_SCB_CPUID_PARTNO_SHIFT               4u
#define S32_SCB_CPUID_PARTNO_WIDTH               12u
#define S32_SCB_CPUID_PARTNO(x)                  (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_PARTNO_SHIFT))&S32_SCB_CPUID_PARTNO_MASK)
#define S32_SCB_CPUID_VARIANT_MASK               0xF00000u
#define S32_SCB_CPUID_VARIANT_SHIFT              20u
#define S32_SCB_CPUID_VARIANT_WIDTH              4u
#define S32_SCB_CPUID_VARIANT(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_VARIANT_SHIFT))&S32_SCB_CPUID_VARIANT_MASK)
#define S32_SCB_CPUID_IMPLEMENTER_MASK           0xFF000000u
#define S32_SCB_CPUID_IMPLEMENTER_SHIFT          24u
#define S32_SCB_CPUID_IMPLEMENTER_WIDTH          8u
#define S32_SCB_CPUID_IMPLEMENTER(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_IMPLEMENTER_SHIFT))&S32_SCB_CPUID_IMPLEMENTER_MASK)
/* ICSR Bit Fields */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
#define S32_SCB_ICSR_VECTACTIVE_MASK             0x3Fu
#define S32_SCB_ICSR_VECTACTIVE_SHIFT            0u
#define S32_SCB_ICSR_VECTACTIVE_WIDTH            6u
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
#define S32_SCB_ICSR_VECTACTIVE_MASK             0x1FFu
#define S32_SCB_ICSR_VECTACTIVE_SHIFT            0u
#define S32_SCB_ICSR_VECTACTIVE_WIDTH            9u
#endif

#define S32_SCB_ICSR_VECTACTIVE(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_VECTACTIVE_SHIFT))&S32_SCB_ICSR_VECTACTIVE_MASK)

